/**********************************************************************************
 * ¹¤³ÌÃû  :²¦´òµç»°
 * ÃèÊö    :Í¨¹ýC51¿ª·¢°å¿ØÖÆÄ£¿é²¦´òÖ¸¶¨µç»°ºÅ
 * ÊµÑéÆ½Ì¨:C51
 * ¿â°æ±¾  :

 * Ó²¼þÁ¬½ÓËµÃ÷
	 Ê¹ÓÃµ¥Æ¬´®¿ÚÓëGPRSÄ£¿éÍ¨ÐÅ 
	 C51        GPRSÄ£¿é
	 P30 (RXD)->RXD
	 P31 (TXD)->TXD
	 GND	    ->GND£

 * Èí¼þ¹¦ÄÜËµÃ÷
   °å×ÓÉÏµçºóÔËÐÐÖ¸Ê¾µÆRUNING_LED»áÒÔÒ»ÃëµÄÆµÂÊÉÁË¸
	 ´ò¿ª´úÂëÐÞ¸Ä¶ÌÐÅÖÐÐÄºÅ¡¢½ÓÊÕ·½ÊÖ»úºÅºÍ¶ÌÐÅÄÚÈÝ£¬±àÒë³É¹¦ºóÏÂÔØµ½µ¥Æ¬»úÀïÃæ£¬
	 ¾Í¿ÉÒÔÊµÏÖ·¢ËÍÒ»ÌõÖÐÎÄ¶ÌÐÅ£¬ÖÐÎÄ¶ÌÐÅ¾ßÌåµÄ½âÎö¿ÉÒÔ²Î¿¼´®¿Úµ÷ÊÔ±Ê¼Ç
**********************************************************************************/
#include "config.h"
#include "string.h"
#include "delay.h"
#include "uart.h"


#define Buf1_Max 200 					  //´®¿Ú2»º´æ³¤¶È
/*************	±¾µØ³£Á¿ÉùÃ÷	**************/
sbit RUNING_LED = P3^2;					//ÔËÐÐÖ¸Ê¾µÆ

static unsigned char *content="0891683108706505F011000D91683197985889F90008AA0C6D4B8BD55DF27ECF5B8C6210";//·¢ËÍ¶ÌÐÅÄÚÈÝ
/************************¶ÌÐÅÄÚÈÝ½âÎö**************************************/
/*
   //¶ÌÐÅÖÐÐÄºÅ£¨µ¹Ðò£©      Ä¿±êÊÖ»ú£¨µ¹Ðò£©         ¶ÌÐÅÄÚÈÝ£¨²âÊÔÒÑ¾­Íê³É£©
     8613800756500F          8613798985989F          
0891 683108706505F0 11000D91 683197985889F9 0008AA0C 6D4B8BD55DF27ECF5B8C6210

*/
/*************  ±¾µØ±äÁ¿ÉùÃ÷	**************/

xdata u8 Uart1_Buf[Buf1_Max];

u8 Times=0,First_Int = 0,shijian=0;

bdata u8 Flag;//¶¨Ê±Æ÷±êÖ¾Î»
sbit Timer0_start =Flag^0;	//¶¨Ê±Æ÷0ÑÓÊ±Æô¶¯¼ÆÊýÆ÷



/*************	±¾µØº¯ÊýÉùÃ÷	**************/
void GPIO_config(void); //¶Ë¿Ú³õÊ¼»¯ÅäÖÃ
void Timer0Init(void);  //¶¨Ê±Æ÷0³õÊ¼»¯
void CLR_Buf1(void);    //Çå³ý´®¿Ú2½ÓÊÕ»º´æ
u8 Find(u8 *a);         //²éÕÒ×Ö·û´®
void Second_AT_Command(u8 *b,u8 *a,u8 wait_time); //·¢ËÍATÖ¸Áîº¯Êý
void Set_Pdu_Mode(void);//ÉèÖÃ¶ÌÐÅÄ£Ê½PDU
void Wait_CREG(void);   //²éÑ¯µÈ´ýÄ£¿é×¢²á³É¹¦
void Send_Pdu_Sms(void);//·¢ËÍÒ»ÌõÖÐÎÄ¶ÌÐÅ
/*************  Íâ²¿º¯ÊýºÍ±äÁ¿ÉùÃ÷*****************/




/*******************************************************************************
* º¯ÊýÃû : main 
* ÃèÊö   : Ö÷º¯Êý
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : ´®¿Ú²¨ÌØÂÊÊÇ9600£¬GPRSÄ£¿éÄ¬ÈÏ²¨ÌØÂÊÊÇ115200£¬ÐèÒª×Ô¼ºÍ¨¹ý´®¿ÚÖúÊÖÐÞ¸Ä
				   Îª9600·½¿ÉÊ¹ÓÃ¡£ 
*******************************************************************************/
void main(void)
{
	Timer0Init();  //³õÊ¼»¯¶¨Ê±Æ÷0
	GPIO_config();
	EA=1;	//¿ª×ÜÖÐ¶Ï
	Uart1Init();    //³õÊ¼»¯´®¿Ú9600
	Wait_CREG();    //²éÑ¯µÈ´ýÄ£¿é×¢²á³É¹¦
	Set_Pdu_Mode();//ÉèÖÃ¶ÌÐÅÎªPDUÄ£Ê½
	Send_Pdu_Sms();//·¢ËÍÒ»Ìõ¶ÌÏûÏ¢
	while(1)
	{
		;
	}
	
}

/*******************************************************************************
* º¯ÊýÃû : Uart1 
* ÃèÊö   : ´®¿Ú1ÖÐ¶Ï·þÎñÈë¿Úº¯Êý
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Uart1() interrupt 4
{
    if (RI)
    {
      RI = 0;                 //Çå³ýRIÎ»
			Uart1_Buf[First_Int] = SBUF;  	  //½«½ÓÊÕµ½µÄ×Ö·û´®´æµ½»º´æÖÐ
			First_Int++;                			//»º´æÖ¸ÕëÏòºóÒÆ¶¯
			if(First_Int > Buf1_Max)       		//Èç¹û»º´æÂú,½«»º´æÖ¸ÕëÖ¸Ïò»º´æµÄÊ×µØÖ·
			{
				First_Int = 0;
			}
    }
    if (TI)
    {
        TI = 0;                 //Çå³ýTIÎ»
    }
}
/*******************************************************************************
* º¯ÊýÃû : Timer0_ISR
* ÃèÊö   : ¶¨Ê±Æ÷0ÖÐ¶Ï·þÎñÈë¿Úº¯Êý,20msÖÐ¶ÏÒ»´Î
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Timer0_ISR() interrupt 1
{
	static u8 Time_count=0;
  TL0 = 0x00;		  //ÖØÖÃ¶¨Ê±Æ÷³õÖµ
	TH0 = 0xB8;		  //ÖØÖÃ¶¨Ê±Æ÷³õÖµ	
	TR0=0;//¹Ø¶¨Ê±Æ÷
	Time_count++;
	if(Time_count>=50)
	{
		Time_count = 0;
		RUNING_LED =~RUNING_LED;
	}
	if(count_20ms) //20msÑÓÊ±¼ÆÊýÆ÷
		count_20ms--;
	if(Timer0_start)
	Times++;
	if(Times > (50*shijian))
	{
		Timer0_start = 0;
		Times = 0;
	}
	TR0=1;//¿ª¶¨Ê±Æ÷
}
/*******************************************************************************
* º¯ÊýÃû : GPIO_config
* ÃèÊö   : IO¿ÚÅäÖÃº¯Êý
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void	GPIO_config(void)
{
		RUNING_LED=0;
}
/*******************************************************************************
* º¯ÊýÃû : Timer0Init
* ÃèÊö   : ¶¨Ê±Æ÷0³õÊ¼»¯£¬20ms¶¨Ê±
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Timer0Init(void)		//20ºÁÃë@11.0592MHz
{
	AUXR &= 0x7F;		//¶¨Ê±Æ÷Ê±ÖÓ12TÄ£Ê½
	TMOD &= 0xF0;		//
	TMOD |= 0x01;		//ÉèÖÃ¶¨Ê±Æ÷Ä£Ê½£¬16Î»¶¨Ê±Æ÷
	TL0 = 0x00;		  //ÉèÖÃ¶¨Ê±Æ÷³õÖµ
	TH0 = 0xB8;		  //ÉèÖÃ¶¨Ê±Æ÷³õÖµ
	TF0 = 0;		    //ÇåTF0±êÖ¾
	TR0 = 1;		    //¶¨Ê±Æ÷0¿ªÊ¼¼ÆÊ±
	ET0 = 1;    	  //Ê¹ÄÜ¶¨Ê±Æ÷0ÖÐ¶Ï
}
/*******************************************************************************
* º¯ÊýÃû : CLR_Buf1
* ÃèÊö   : Çå³ý´®¿Ú2»º´æÊý¾Ý
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void CLR_Buf1(void)
{
	u16 k;
	for(k=0;k<Buf1_Max;k++)      //½«»º´æÄÚÈÝÇåÁã
	{
		Uart1_Buf[k] = 0x00;
	}
    First_Int = 0;              //½ÓÊÕ×Ö·û´®µÄÆðÊ¼´æ´¢Î»ÖÃ
}

/*******************************************************************************
* º¯ÊýÃû : Find
* ÃèÊö   : ÅÐ¶Ï»º´æÖÐÊÇ·ñº¬ÓÐÖ¸¶¨µÄ×Ö·û´®
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : unsigned char:1 ÕÒµ½Ö¸¶¨×Ö·û£¬0 Î´ÕÒµ½Ö¸¶¨×Ö·û 
* ×¢Òâ   : 
*******************************************************************************/

u8 Find(u8 *a)
{ 
  if(strstr(Uart1_Buf,a)!=NULL)
	    return 1;
	else
			return 0;
}

/*******************************************************************************
* º¯ÊýÃû : Second_AT_Command
* ÃèÊö   : ·¢ËÍATÖ¸Áîº¯Êý
* ÊäÈë   : ·¢ËÍÊý¾ÝµÄÖ¸Õë¡¢·¢ËÍµÈ´ýÊ±¼ä(µ¥Î»£ºS)
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/

void Second_AT_Command(u8 *b,u8 *a,u8 wait_time)         
{
	u8 i;
	u8 *c;
	c = b;										//±£´æ×Ö·û´®µØÖ·µ½c
	CLR_Buf1(); 
  i = 0;
	while(i == 0)                    
	{
		if(!Find(a))           //²éÕÒÐèÒªÓ¦´ðµÄ×Ö·û
		{
			if(Timer0_start == 0)//³¬Ê±ÖØÐÂ·¢ËÍÃüÁî
			{
				b = c;						 //½«×Ö·û´®µØÖ·¸øb
				for (b; *b!='\0';b++)
				{
					UART1_SendData(*b);
				}
				UART1_SendLR();	
				Times = 0;
				shijian = wait_time;
				Timer0_start = 1;  //¿ªÊ¼¼ÆÊ±
		   }
    }
 	  else
		{
			i = 1;
			Timer0_start = 0;  
		}
	}
	CLR_Buf1(); 
}

/*******************************************************************************
* º¯ÊýÃû : Set_Pdu_Mode
* ÃèÊö   : ÉèÖÃ¶ÌÐÅÎªTEXTÎÄ±¾Ä£Ê½
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Set_Pdu_Mode(void)
{
	Second_AT_Command("ATE0","OK",3);										  //È¡Ïû»ØÏÔ	
	Second_AT_Command("AT+CMGF=0","OK",3);								//ÉèÖÃPDUÄ£Ê½	
	Second_AT_Command("AT+CPMS=\"SM\",\"SM\",\"SM\"","OK",3);//ËùÓÐ²Ù×÷¶¼ÔÚSIM¿¨ÖÐ½øÐÐ
}
/*******************************************************************************
* º¯ÊýÃû : Send_Pdu_Sms
* ÃèÊö   : ·¢ËÍPDUÎÄ±¾¶ÌÐÅ
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Send_Pdu_Sms(void)
{

	Second_AT_Command("AT+CMGS=27",">",3); //·¢ËÍÊý¾Ý³¤¶È£º27£¨¾ßÌåµÄ¼ÆËã·½·¨¿´´®¿Úµ÷ÊÔ±È½Ï£©½ÓÊÕµ½¡°>¡±²Å·¢ËÍ¶ÌÐÅÄÚÈÝ
	UART1_SendString(content);     //·¢ËÍ¶ÌÐÅÄÚÈÝ
	UART1_SendData(0X1A);          //·¢ËÍ½áÊø·û
}

/*******************************************************************************
* º¯ÊýÃû : Wait_CREG
* ÃèÊö   : µÈ´ýÄ£¿é×¢²á³É¹¦
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Wait_CREG(void)
{
	u8 i;
	u8 k;
	i = 0;
	CLR_Buf1();
  while(i == 0)        			
	{
		CLR_Buf1();        
		UART1_SendString("AT+CREG?");//²éÑ¯Ä£¿éÍøÂç×¢²á×´Ì¬
		UART1_SendLR();
		delay_ms(250);  						
	    for(k=0;k<Buf1_Max;k++)      			
    	{
			if(Uart1_Buf[k] == ':')
			{
				if((Uart1_Buf[k+4] == '1')||(Uart1_Buf[k+4] == '5')) //±íÃ÷ÍøÂç×¢²á³É¹¦
				{
					i = 1;
				  break;
				}
			}
		}
	}
}
